simplementeUnPorito/Micro-1-repo/Programas PsoC/TPF/Micro1.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "POT.h"
#include "pot1_aliases.h"
#include "pot1.h"
#include "PWM2.h"
#include "Servo_aliases.h"
#include "Servo.h"
#include "I2C_LCD.h"
#include "I2C_LCD_PVT.h"
#include "SCL_1_aliases.h"
#include "SCL_1.h"
#include "SDA_1_aliases.h"
#include "SDA_1.h"
#include "ClockPWM.h"
#include "PWM1.h"
#include "PC.h"
#include "keyboard_out_aliases.h"
#include "keyboard_out.h"
#include "keyboard_in_aliases.h"
#include "keyboard_in.h"
#include "POT_IRQ.h"
#include "POT_theACLK.h"
#include "PC_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

